Baanaaana/esp32-irk-finder/src/main.cpp
        .description {
            font-size: 0.75rem;
            color: var(--muted-foreground);
            margin-bottom: 0.5rem;
        }

        .input-group {
            position: relative;
            display: flex;
            align-items: center;
            gap: 0.5rem;
        }

        .input {
            flex: 1;
            padding: 0.625rem 0.875rem;
            font-size: 0.875rem;
            font-family: 'SF Mono', 'Monaco', 'Inconsolata', 'Fira Code', monospace;
            background: var(--background);
            border: 1px solid var(--border);
            border-radius: calc(var(--radius) - 2px);
            color: var(--foreground);
            word-break: break-all;
            transition: border-color 0.2s;
        }

        .input:focus {
            outline: none;
            border-color: var(--ring);
            box-shadow: 0 0 0 3px rgb(23 23 23 / 0.05);
        }

        .btn {
            padding: 0.5rem 1rem;
            font-size: 0.875rem;
            font-weight: 500;
            border-radius: calc(var(--radius) - 2px);
            border: 1px solid transparent;
            cursor: pointer;
            transition: all 0.2s;
            display: inline-flex;
            align-items: center;
            justify-content: center;
        }

        .btn-primary {
            background: var(--primary);
            color: var(--primary-foreground);
            border-color: var(--primary);
        }

        .btn-primary:hover {
            background: #262626;
        }

        .btn-outline {
            background: var(--background);
            color: var(--foreground);
            border-color: var(--border);
        }

        .btn-outline:hover {
            background: var(--secondary);
        }

        .btn-black {
            background: var(--primary);
            color: var(--primary-foreground);
            border-color: var(--primary);
        }

        .btn-black:hover {
            background: #262626;
        }

        .btn-copy {
            padding: 0.375rem 0.75rem;
            font-size: 0.75rem;
            white-space: nowrap;
        }

        .instructions {
            background: var(--muted);
            border-radius: var(--radius);
            padding: 1.5rem;
            margin-top: 1.5rem;
        }

        .instructions h3 {
            font-size: 1rem;
            font-weight: 600;
            margin-bottom: 1rem;
            color: var(--foreground);
        }

        .instructions ol {
            padding-left: 1.5rem;
            color: var(--muted-foreground);
        }

        .instructions li {
            margin-bottom: 0.5rem;
            font-size: 0.875rem;
        }

        .instructions code {
            background: var(--primary);
            color: var(--primary-foreground);
            padding: 0.125rem 0.375rem;
            border-radius: 0.25rem;
            font-weight: 600;
            font-size: 0.875rem;
        }

        .hidden {
            display: none;
        }

        @media (max-width: 640px) {
            .container {
                padding: 1rem;
            }

            h1 {
                font-size: 1.5rem;
            }

            .card-content {
                padding: 1rem;
            }
        }
    </style>
    <script>
        function copyToClipboard(elementId, btnElement) {
            const element = document.getElementById(elementId);
            const text = element.value || element.textContent;

            // Create a temporary textarea for copying
            const tempTextArea = document.createElement('textarea');
            tempTextArea.value = text;
            tempTextArea.style.position = 'fixed';
            tempTextArea.style.left = '-999999px';
            tempTextArea.style.top = '-999999px';
            document.body.appendChild(tempTextArea);
            tempTextArea.select();

            try {
                document.execCommand('copy');
                const originalText = btnElement.textContent;
                btnElement.textContent = 'Copied!';
                btnElement.style.background = '#22c55e';

                setTimeout(() => {
                    btnElement.textContent = originalText;
                    btnElement.style.background = '';
                }, 2000);
            } catch (err) {
                console.error('Failed to copy text: ', err);
            }

            document.body.removeChild(tempTextArea);
        }

        function refreshData() {
            fetch('/api/status')
                .then(response => response.json())
                .then(data => {
                    document.getElementById('irk').value = data.irk || '';
                    document.getElementById('irk-reversed').value = data.irkReversed || '';
                    document.getElementById('irk-base64').value = data.irkBase64 || '';
                    document.getElementById('irk-array').value = data.irkArray || '';
                    document.getElementById('mac').value = data.mac || 'None';

                    const statusDiv = document.getElementById('status');
                    const formatsDiv = document.getElementById('irk-formats');
                    const macDiv = document.getElementById('mac-container');

                    if (data.irkRetrieved) {
                        statusDiv.className = 'alert alert-success';
                        statusDiv.textContent = 'IRK Successfully Retrieved!';
                        formatsDiv.classList.remove('hidden');
                        macDiv.classList.remove('hidden');
                    } else {
                        statusDiv.className = 'alert alert-warning';
                        statusDiv.textContent = 'Waiting for iPhone pairing...';
                        formatsDiv.classList.add('hidden');
                        macDiv.classList.add('hidden');
                    }
                });
        }

        setInterval(refreshData, 2000);
        window.onload = refreshData;
    </script>
</head>
<body>
    <div class="container">
        <h1>ESP32 IRK Finder</h1>

        <div id="status" class="alert alert-warning">Waiting for iPhone pairing...</div>

        <div id="mac-container" class="card hidden">
            <div class="card-content">
                <label class="label">Device MAC</label>
                <div class="input-group">
                    <input id="mac" class="input" readonly value="None">
                </div>
            </div>
        </div>

