Baanaaana/esp32-irk-finder/src/main.cpp
        <div id="irk-formats" class="hidden">
            <div class="card">
                <div class="card-content">
                    <label class="label">Standard IRK (Hex)</label>
                    <p class="description">Original format - use for debugging</p>
                    <div class="input-group">
                        <input id="irk" class="input" readonly>
                        <button class="btn btn-black btn-copy" onclick="copyToClipboard('irk', this)">Copy</button>
                    </div>
                </div>
            </div>

            <div class="card">
                <div class="card-content">
                    <label class="label">ESPresense Format (Reversed)</label>
                    <p class="description">Use with device_id: "irk:..." in ESPresense/Home Assistant</p>
                    <div class="input-group">
                        <input id="irk-reversed" class="input" readonly>
                        <button class="btn btn-black btn-copy" onclick="copyToClipboard('irk-reversed', this)">Copy</button>
                    </div>
                </div>
            </div>

            <div class="card">
                <div class="card-content">
                    <label class="label">Base64 Format</label>
                    <p class="description">For Home Assistant Private BLE Device integration</p>
                    <div class="input-group">
                        <input id="irk-base64" class="input" readonly>
                        <button class="btn btn-black btn-copy" onclick="copyToClipboard('irk-base64', this)">Copy</button>
                    </div>
                </div>
            </div>

            <div class="card">
                <div class="card-content">
                    <label class="label">Hex Array Format</label>
                    <p class="description">For custom implementations and programming</p>
                    <div class="input-group">
                        <input id="irk-array" class="input" readonly>
                        <button class="btn btn-black btn-copy" onclick="copyToClipboard('irk-array', this)">Copy</button>
                    </div>
                </div>
            </div>
        </div>

        <div class="instructions">
            <h3>How to retrieve iPhone IRK</h3>
            <ol>
                <li>Download a BLE scanner app from the App Store:
                    <ul style="margin-top: 0.5rem; list-style-type: disc; padding-left: 1.5rem;">
                        <li><code>LightBlue</code></li>
                        <li><code>nRF Connect</code></li>
                        <li><code>Bluetooth Terminal</code></li>
                        <li><code>BLE Scanner</code></li>
                    </ul>
                </li>
                <li>Open the BLE scanner app and scan for devices</li>
                <li>Look for <code>ESP32_IRK_FINDER</code> in the device list</li>
                <li>Tap to connect</li>
                <li>When prompted for pairing, accept the request</li>
                <li>Enter passkey: <code>123456</code></li>
                <li>After successful pairing, the IRK will appear above in multiple formats</li>
            </ol>
        </div>
    </div>
</body>
</html>
)rawliteral";

// Full HRS Database Description
static const esp_gatts_attr_db_t heart_rate_gatt_db[HRS_IDX_NB] = {
    // Heart Rate Service Declaration
    [HRS_IDX_SVC] = {
        {ESP_GATT_AUTO_RSP},
        {ESP_UUID_LEN_16, (uint8_t *)&primary_service_uuid, ESP_GATT_PERM_READ,
         sizeof(uint16_t), sizeof(GATTS_SERVICE_UUID_HEART_RATE), (uint8_t *)&GATTS_SERVICE_UUID_HEART_RATE}
    },

    // Heart Rate Measurement Characteristic Declaration
    [HRS_IDX_HR_MEAS_CHAR] = {
        {ESP_GATT_AUTO_RSP},
        {ESP_UUID_LEN_16, (uint8_t *)&character_declaration_uuid, ESP_GATT_PERM_READ,
         sizeof(uint8_t), sizeof(uint8_t), (uint8_t *)&char_prop_notify}
    },

    // Heart Rate Measurement Characteristic Value
    [HRS_IDX_HR_MEAS_VAL] = {
        {ESP_GATT_AUTO_RSP},
        {ESP_UUID_LEN_16, (uint8_t *)&heart_rate_meas_uuid, ESP_GATT_PERM_READ,
         13, 0, NULL}
    },

    // Heart Rate Measurement Characteristic - Client Characteristic Configuration Descriptor
    [HRS_IDX_HR_MEAS_NTF_CFG] = {
        {ESP_GATT_AUTO_RSP},
        {ESP_UUID_LEN_16, (uint8_t *)&character_client_config_uuid, ESP_GATT_PERM_READ | ESP_GATT_PERM_WRITE,
         sizeof(uint16_t), sizeof(heart_measurement_ccc), (uint8_t *)heart_measurement_ccc}
    },

    // Body Sensor Location Characteristic Declaration
    [HRS_IDX_BOBY_SENSOR_LOC_CHAR] = {
        {ESP_GATT_AUTO_RSP},
        {ESP_UUID_LEN_16, (uint8_t *)&character_declaration_uuid, ESP_GATT_PERM_READ,
         sizeof(uint8_t), sizeof(uint8_t), (uint8_t *)&char_prop_read}
    },

    // Body Sensor Location Characteristic Value
    [HRS_IDX_BOBY_SENSOR_LOC_VAL] = {
        {ESP_GATT_AUTO_RSP},
        {ESP_UUID_LEN_16, (uint8_t *)&body_sensor_location_uuid, ESP_GATT_PERM_READ_ENCRYPTED,
         sizeof(uint8_t), sizeof(body_sensor_loc_val), (uint8_t *)body_sensor_loc_val}
    },

    // Heart Rate Control Point Characteristic Declaration
    [HRS_IDX_HR_CTNL_PT_CHAR] = {
        {ESP_GATT_AUTO_RSP},
        {ESP_UUID_LEN_16, (uint8_t *)&character_declaration_uuid, ESP_GATT_PERM_READ,
         sizeof(uint8_t), sizeof(uint8_t), (uint8_t *)&char_prop_read_write}
    },

    // Heart Rate Control Point Characteristic Value
    [HRS_IDX_HR_CTNL_PT_VAL] = {
        {ESP_GATT_AUTO_RSP},
        {ESP_UUID_LEN_16, (uint8_t *)&heart_rate_ctrl_point, ESP_GATT_PERM_WRITE_ENCRYPTED | ESP_GATT_PERM_READ_ENCRYPTED,
         sizeof(uint8_t), sizeof(heart_ctrl_point), (uint8_t *)heart_ctrl_point}
    },
};

// Function to show bonded devices and extract IRK
static void show_bonded_devices(void) {
    int dev_num = esp_ble_get_bond_device_num();

    if(dev_num == 0) {
        ESP_LOGI(GATTS_TABLE_TAG, "No bonded devices");
        return;
    }

    esp_ble_bond_dev_t *dev_list = (esp_ble_bond_dev_t *)malloc(sizeof(esp_ble_bond_dev_t) * dev_num);
    esp_ble_get_bond_device_list(&dev_num, dev_list);
    ESP_LOGI(GATTS_TABLE_TAG, "Bonded devices: %d", dev_num);

    for (int i = 0; i < dev_num; i++) {
        // Extract MAC address
        char mac_str[18];
        sprintf(mac_str, "%02X:%02X:%02X:%02X:%02X:%02X",
                dev_list[i].bd_addr[0], dev_list[i].bd_addr[1],
                dev_list[i].bd_addr[2], dev_list[i].bd_addr[3],
                dev_list[i].bd_addr[4], dev_list[i].bd_addr[5]);

        connectedDeviceMAC = String(mac_str);

        // Extract IRK
        char irk_str[33];
        uint8_t* irk_bytes = dev_list[i].bond_key.pid_key.irk;

