Baanaaana/esp32-irk-finder/src/main.cpp
    for (int idx = 0; idx < HEART_PROFILE_NUM; idx++) {
        if (gatts_if == ESP_GATT_IF_NONE || gatts_if == heart_rate_profile_tab[idx].gatts_if) {
            if (heart_rate_profile_tab[idx].gatts_cb) {
                heart_rate_profile_tab[idx].gatts_cb(event, gatts_if, param);
            }
        }
    }
}

// Initialize Bluetooth
void BT_Init() {
    ESP_LOGI(GATTS_TABLE_TAG, "Initializing Bluetooth...");

    // Initialize NVS
    esp_err_t ret = nvs_flash_init();
    if (ret == ESP_ERR_NVS_NO_FREE_PAGES || ret == ESP_ERR_NVS_NEW_VERSION_FOUND) {
        ESP_ERROR_CHECK(nvs_flash_erase());
        ret = nvs_flash_init();
    }
    ESP_ERROR_CHECK(ret);

    // Start Bluetooth
    btStart();

    // Initialize Bluedroid
    esp_bluedroid_status_t bt_state = esp_bluedroid_get_status();
    if (bt_state == ESP_BLUEDROID_STATUS_UNINITIALIZED) {
        ESP_ERROR_CHECK(esp_bluedroid_init());
    }

    if (bt_state != ESP_BLUEDROID_STATUS_ENABLED) {
        ESP_ERROR_CHECK(esp_bluedroid_enable());
    }

    // Register callbacks
    ESP_ERROR_CHECK(esp_ble_gatts_register_callback(gatts_event_handler));
    ESP_ERROR_CHECK(esp_ble_gap_register_callback(gap_event_handler));
    ESP_ERROR_CHECK(esp_ble_gatts_app_register(ESP_HEART_RATE_APP_ID));

    // Configure security parameters
    esp_ble_auth_req_t auth_req = ESP_LE_AUTH_REQ_SC_MITM_BOND;
    esp_ble_io_cap_t iocap = ESP_IO_CAP_NONE;
    uint8_t key_size = 16;
    uint8_t init_key = ESP_BLE_ENC_KEY_MASK | ESP_BLE_ID_KEY_MASK;
    uint8_t rsp_key = ESP_BLE_ENC_KEY_MASK | ESP_BLE_ID_KEY_MASK;
    uint32_t passkey = 123456;
    uint8_t auth_option = ESP_BLE_ONLY_ACCEPT_SPECIFIED_AUTH_DISABLE;

    esp_ble_gap_set_security_param(ESP_BLE_SM_SET_STATIC_PASSKEY, &passkey, sizeof(uint32_t));
    esp_ble_gap_set_security_param(ESP_BLE_SM_AUTHEN_REQ_MODE, &auth_req, sizeof(uint8_t));
    esp_ble_gap_set_security_param(ESP_BLE_SM_IOCAP_MODE, &iocap, sizeof(uint8_t));
    esp_ble_gap_set_security_param(ESP_BLE_SM_MAX_KEY_SIZE, &key_size, sizeof(uint8_t));
    esp_ble_gap_set_security_param(ESP_BLE_SM_ONLY_ACCEPT_SPECIFIED_SEC_AUTH, &auth_option, sizeof(uint8_t));
    esp_ble_gap_set_security_param(ESP_BLE_SM_SET_INIT_KEY, &init_key, sizeof(uint8_t));
    esp_ble_gap_set_security_param(ESP_BLE_SM_SET_RSP_KEY, &rsp_key, sizeof(uint8_t));

    Serial.println("Bluetooth initialized - Passkey: 123456");
}

// Setup WiFi
void setupWiFi() {
    Serial.println("Connecting to WiFi...");
    WiFi.mode(WIFI_STA);
    WiFi.begin(WIFI_SSID, WIFI_PASSWORD);

    int attempts = 0;
    while (WiFi.status() != WL_CONNECTED && attempts < 20) {
        delay(500);
        Serial.print(".");
        attempts++;
    }

    if (WiFi.status() == WL_CONNECTED) {
        Serial.println("\nWiFi connected!");
        Serial.print("IP address: ");
        Serial.println(WiFi.localIP());
    } else {
        Serial.println("\nFailed to connect to WiFi. Starting AP mode...");
        WiFi.mode(WIFI_AP);
        WiFi.softAP(AP_SSID, AP_PASSWORD);
        Serial.print("AP IP address: ");
        Serial.println(WiFi.softAPIP());
    }
}

// Setup web server
void setupWebServer() {
    server.on("/", HTTP_GET, [](AsyncWebServerRequest *request){
        request->send_P(200, "text/html", index_html);
    });

    server.on("/api/status", HTTP_GET, [](AsyncWebServerRequest *request){
        String json = "{";
        json += "\"irk\":\"" + currentIRK + "\",";
        json += "\"irkReversed\":\"" + currentIRKReversed + "\",";
        json += "\"irkBase64\":\"" + currentIRKBase64 + "\",";
        json += "\"irkArray\":\"" + currentIRKArray + "\",";
        json += "\"mac\":\"" + connectedDeviceMAC + "\",";
        json += "\"irkRetrieved\":" + String(irkRetrieved ? "true" : "false");
        json += "}";
        request->send(200, "application/json", json);
    });

    server.begin();
    Serial.println("Web server started");
}

void setup() {
    Serial.begin(115200);
    delay(1000);

    Serial.println("\n========================================");
    Serial.println("ESP32 IRK Finder - Bluedroid Version");
    Serial.println("========================================");

    // Setup LED
    pinMode(LED_PIN, OUTPUT);
    digitalWrite(LED_PIN, LOW);

    // Configure advertising
    heart_rate_adv_config.set_scan_rsp = false;
    heart_rate_adv_config.include_txpower = true;
    heart_rate_adv_config.min_interval = 0x0006;
    heart_rate_adv_config.max_interval = 0x0010;
    heart_rate_adv_config.appearance = 0x00;
    heart_rate_adv_config.manufacturer_len = 0;
    heart_rate_adv_config.p_manufacturer_data = NULL;
    heart_rate_adv_config.service_data_len = 0;
    heart_rate_adv_config.p_service_data = NULL;
    heart_rate_adv_config.service_uuid_len = sizeof(sec_service_uuid);
    heart_rate_adv_config.p_service_uuid = sec_service_uuid;
    heart_rate_adv_config.flag = (ESP_BLE_ADV_FLAG_GEN_DISC | ESP_BLE_ADV_FLAG_BREDR_NOT_SPT);

    heart_rate_scan_rsp_config.set_scan_rsp = true;
    heart_rate_scan_rsp_config.include_name = true;
    heart_rate_scan_rsp_config.manufacturer_len = sizeof(test_manufacturer);
    heart_rate_scan_rsp_config.p_manufacturer_data = test_manufacturer;

    heart_rate_adv_params.adv_int_min = 0x100;
    heart_rate_adv_params.adv_int_max = 0x100;
    heart_rate_adv_params.adv_type = ADV_TYPE_IND;
    heart_rate_adv_params.own_addr_type = BLE_ADDR_TYPE_RANDOM;
    heart_rate_adv_params.channel_map = ADV_CHNL_ALL;
    heart_rate_adv_params.adv_filter_policy = ADV_FILTER_ALLOW_SCAN_ANY_CON_ANY;

    // Setup WiFi
    setupWiFi();

    // Setup web server
    setupWebServer();

    // Initialize Bluetooth
    BT_Init();

    // Clear all bonded devices on startup
    delay(1000);
    remove_all_bonded_devices();

    Serial.println("\n========================================");
    Serial.println("System ready!");
    Serial.print("Web interface: http://");
    Serial.println(WiFi.localIP());
    Serial.println("BLE Device name: ESP32_IRK_FINDER");
    Serial.println("Passkey: 123456");
    Serial.println("========================================\n");
}

void loop() {
    delay(1000);

    // Check for bonded devices periodically
    static unsigned long lastCheck = 0;
    if (millis() - lastCheck > 5000) {
        lastCheck = millis();
        if (!irkRetrieved) {
            show_bonded_devices();
        }
    }
}